src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.Резервы</registerRecords>
  <attributes>
    <name>ФИО_клиента</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолучения</name>
    <type>
      <types>EnumRef.СпособПолученияЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СдачаДляКурьеров</name>
    <type>
      <types>EnumRef.Сдача</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЕдиницы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупочнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/Заказ/Forms/ФормаДокумента/Module.bsl
Перем РезультатПроверки;
Перем КоличествоНоменклатуры;

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Итог = 0;
	Для каждого элемент из Объект.Товары Цикл
		Сумма = Элемент.Сумма;
		Итог = Сумма+Итог;	
		
	КонецЦикла;
	
	
	Объект.ИтоговаяСумма = Итог;	
	Итог = 0
КонецПроцедуры


&НаСервере
Процедура ОбращениеКОбщемуМодулю(Номенклатура, Цена, ТребуемоеЗначение)
	
	
	УзнатьЦенуТовара(Номенклатура,Цена,ТребуемоеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура РаботаСНоменклатурой(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	Номенклатура = Текст;
	Цена = NULL;
	ТребуемоеЗначение = "Розничная";
	
	ОбращениеКОбщемуМодулю(Номенклатура, Цена, ТребуемоеЗначение);
	Строка = Элементы.Товары.ТекущиеДанные;
	Строка.ЦенаЕдиницы = Цена; 
	ТребуемоеЗначение = "Закупочная";
	ОбращениеКОбщемуМодулю(Номенклатура, Цена, ТребуемоеЗначение); 
	Строка.ЗакупочнаяЦена = Цена;
	
	РезультатПроверки = NULL;
	КоличествоНоменклатуры = NULL;
	ПроверкаОстатков.ПроверкаОстатков(Номенклатура,РезультатПроверки,КоличествоНоменклатуры);
	Если РезультатПроверки = NULL или РезультатПроверки = "Нет" тогда
		
		
		ТекстСообщения = "Номенклатуры нет в наличии!Выберите другое наименование";
		Поле="Номенклатура";
		СообщенияОбОшибке(Поле,ТекстСообщения);
		
		Иначе Если РезультатПроверки = "Есть" тогда
			Сообщить(  "В наличии "+КоличествоНоменклатуры+" Штук");
		КонецЕсли;
	КонецЕсли
	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчетСуммНоменклатуры(Элемент)
		
	РезультатПроверки = NULL;
	КоличествоНоменклатуры = NULL;
	

	Строка = Элементы.Товары.ТекущиеДанные;
	ПроверкаОстатков.ПроверкаОстатков(Строка.Номенклатура,РезультатПроверки,КоличествоНоменклатуры);

	Если Строка.Количество > КоличествоНоменклатуры Тогда
				Строка.Количество = NULL;
				
		Текст = "Вы ввели слишком большое количесто товара!На складе в наличии "+КоличествоНоменклатуры+" единицы.";
		Поле="Количество";
		СообщенияОбОшибке(Поле,Текст);

		Иначе
	Строка.Сумма = Строка.Количество*Строка.ЦенаЕдиницы;
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ФИО_клиентаОбработкаВыбораНаСервере(ВыбранноеЗначение,Телефон,Мейл)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Клиенты.Наименование КАК Наименование,
	|	Клиенты.Телефон КАК Телефон,
	|	Клиенты.email КАК email
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Строка(ВыбранноеЗначение));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Мейл = ВыборкаДетальныеЗаписи.email;
		
		Телефон = ВыборкаДетальныеЗаписи.Телефон;
		
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФИО_клиентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ФИО = ВыбранноеЗначение;
	Телефон = NULL;
	Мейл = NULL;//Код = ВыбранноеЗначение.Код;
	ФИО_клиентаОбработкаВыбораНаСервере(ВыбранноеЗначение,Телефон,Мейл);
	Объект.Телефон = Телефон;
	Объект.email = Мейл;
	
	
КонецПроцедуры
